local-MyRocks/raw/res.mysql57.tokudb.OLTP/res.thr10.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Threads started!

[  10s] threads: 10, tps: 4568.30, reads: 63967.35, writes: 0.00, response time: 2.19ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 10, tps: 5039.11, reads: 70542.33, writes: 0.00, response time: 2.16ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 10, tps: 5034.50, reads: 70483.46, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 10, tps: 5020.00, reads: 70282.94, writes: 0.00, response time: 2.19ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 10, tps: 5033.39, reads: 70465.79, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 10, tps: 5019.01, reads: 70266.54, writes: 0.00, response time: 2.19ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 10, tps: 5031.60, reads: 70439.42, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 10, tps: 5036.10, reads: 70509.34, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 10, tps: 5037.50, reads: 70524.92, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 10, tps: 5014.00, reads: 70193.31, writes: 0.00, response time: 2.19ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 10, tps: 5004.80, reads: 70070.53, writes: 0.00, response time: 2.20ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 10, tps: 5039.20, reads: 70549.49, writes: 0.00, response time: 2.16ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 10, tps: 5022.00, reads: 70307.91, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 10, tps: 4978.00, reads: 69692.10, writes: 0.00, response time: 2.24ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 10, tps: 4999.10, reads: 69986.63, writes: 0.00, response time: 2.21ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 10, tps: 5034.90, reads: 70488.40, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 10, tps: 5031.90, reads: 70445.11, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 10, tps: 5023.10, reads: 70325.96, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 10, tps: 5037.80, reads: 70528.75, writes: 0.00, response time: 2.16ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 10, tps: 5030.10, reads: 70420.29, writes: 0.00, response time: 2.16ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 10, tps: 5027.90, reads: 70394.01, writes: 0.00, response time: 2.16ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 10, tps: 5024.00, reads: 70328.89, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 10, tps: 4976.70, reads: 69678.71, writes: 0.00, response time: 2.22ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 10, tps: 5005.60, reads: 70075.44, writes: 0.00, response time: 2.20ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 10, tps: 5018.20, reads: 70255.41, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 10, tps: 5020.80, reads: 70291.15, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 10, tps: 5025.60, reads: 70354.54, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 10, tps: 5039.30, reads: 70556.44, writes: 0.00, response time: 2.18ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 10, tps: 5035.30, reads: 70491.21, writes: 0.00, response time: 2.17ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            21033334
        write:                           0
        other:                           3004762
        total:                           24038096
    transactions:                        1502381 (5007.91 per sec.)
    read/write requests:                 21033334 (70110.70 per sec.)
    other operations:                    3004762 (10015.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0018s
    total number of events:              1502381
    total time taken by event execution: 2989.4195s
    response time:
         min:                                  1.57ms
         avg:                                  1.99ms
         max:                                  5.32ms
         approx.  95 percentile:               2.18ms

Threads fairness:
    events (avg/stddev):           150238.1000/1025.74
    execution time (avg/stddev):   298.9419/0.30